Ran Plan for dir: `terraform/kubernetes` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place

Terraform will perform the following actions:

  # proxmox_virtual_environment_vm.kube_wk[0] will be updated in-place
~ resource "proxmox_virtual_environment_vm" "kube_wk" {
        id                      = "550"
      ~ ipv4_addresses          = [] -> (known after apply)
      ~ ipv6_addresses          = [] -> (known after apply)
        name                    = "wk-polaris-0"
      ~ network_interface_names = [] -> (known after apply)
      ~ started                 = false -> true
        tags                    = [
            "k8s",
            "terraform",
            "wk",
        ]
        # (21 unchanged attributes hidden)

      - memory {
          - dedicated = 512 -> null
          - floating  = 0 -> null
          - shared    = 5125 -> null
        }

        # (9 unchanged blocks hidden)
    }

  # proxmox_virtual_environment_vm.kube_wk[1] will be updated in-place
~ resource "proxmox_virtual_environment_vm" "kube_wk" {
        id                      = "551"
      ~ ipv4_addresses          = [] -> (known after apply)
      ~ ipv6_addresses          = [] -> (known after apply)
        name                    = "wk-polaris-1"
      ~ network_interface_names = [] -> (known after apply)
      ~ started                 = false -> true
        tags                    = [
            "k8s",
            "terraform",
            "wk",
        ]
        # (21 unchanged attributes hidden)

      - memory {
          - dedicated = 512 -> null
          - floating  = 0 -> null
          - shared    = 5125 -> null
        }

        # (9 unchanged blocks hidden)
    }

  # proxmox_virtual_environment_vm.kube_wk[2] will be updated in-place
~ resource "proxmox_virtual_environment_vm" "kube_wk" {
        id                      = "552"
      ~ ipv4_addresses          = [] -> (known after apply)
      ~ ipv6_addresses          = [] -> (known after apply)
        name                    = "wk-polaris-2"
      ~ network_interface_names = [] -> (known after apply)
      ~ started                 = false -> true
        tags                    = [
            "k8s",
            "terraform",
            "wk",
        ]
        # (21 unchanged attributes hidden)

      - memory {
          - dedicated = 512 -> null
          - floating  = 0 -> null
          - shared    = 5125 -> null
        }

        # (9 unchanged blocks hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform/kubernetes`
* :put_litter_in_its_place: To **delete** this plan click [here](http://e779aff7675f:4141/lock?id=resnostyle%252Fk8s-gitops%252Fterraform%252Fkubernetes%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform/kubernetes`
</details>
Plan: 0 to add, 3 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`